
[EUBullRushPassive X2AbilityTemplate]
LocFriendlyName="残暴冲锋"
LocLongDescription="凶猛的冲锋和近战攻击，极大地降低了目标的机动性。"
LocHelpText="凶猛的冲锋和近战攻击，极大地降低了目标的机动性。"
LocFlyOverText="残暴冲锋"

[EUBullRush X2AbilityTemplate]
LocFriendlyName="残暴冲锋"
LocLongDescription="凶猛的冲锋和近战攻击，极大地降低了目标的机动性。装甲狂战士不能再被击晕在他们第一次冲锋之后。"
LocHelpText="凶猛的冲锋和近战攻击，极大地降低了目标的机动性。装甲狂战士不能再被击晕在他们第一次冲锋之后。"
LocFlyOverText="残暴冲锋"

[EUBerserkerDevastatingPunch X2AbilityTemplate]
LocFriendlyName="致残打击"
LocLongDescription="一个装甲狂战士只需要它的拳头就足以杀死它的敌人。但是，装甲狂战士佩带有巨大金属爪的护手，不仅可以击晕或使目标混乱，还可以在2个回合内削弱目标的机动性。"
LocHelpText="攻击近战目标，有可能使其昏迷并降低其机动性。"
LocFlyOverText="致残打击"

[EUBMeleeResistance X2AbilityTemplate]
LocFriendlyName="近战抗性"
LocLongDescription="装甲狂战士遭受的所有近战伤害减少3点."
LocHelpText="减少近战伤害"
LocFlyOverText="近战抗性"

[EUBerserker X2CharacterTemplate]
strCharacterName="装甲狂战士"
strAcquiredText="装甲狂战士与普通狂战士很像，不同在于它们的护甲给予它们近战伤害减免以及火免疫。它们带金属爪的护手给了它们更致命的攻击能力，能削弱目标的机动性。它们还可以对一个毫无防备的敌人发动致命的残暴冲锋。" 


